# Pandas

In [64]:
# Introduction to Pandas
# Exploring Pandas Series
# Introduction to Pandas DataFrame
# Implementing Basic DataFrame Functionalities
# Importing & Exporting Data

### Introduction to Pandas

Pandas is a fast, powerful, flexible and easy to use open source data analysis and manipulation tool,
built on top of the Python programming language.

In [68]:
# 1. A fast and efficient DataFrame object for data manipulation.
# 2. Tools for reading and writing data between in-memory data structures and different formats: CSV and text files, 
#     Microsoft Excel, SQL databases.
# 3. Intelligent data alignment and integrated handling of missing data:easily manipulate messy data into an orderly form.
# 4. Flexible reshaping and pivoting of data sets.
# 5. Intelligent label-based slicing, fancy indexing, and subsetting of large data sets.
# 6. Columns can be inserted and deleted from data structures for size mutability.

### Features

In [70]:
# 1. Data Wrangling
# 2. Modeling
# 3. Visualization
# 4. High Performance Computing
# 5. Text Processing
# 6. Statistical Computing
# 7. Numerical Computing

### Exploring Pandas Series

In [75]:
# Creating Pandas Series from Numpy Array & Dictionary

In [79]:
import numpy as np
import pandas as pd

In [81]:
print(pd.__version__)

2.2.2

In [83]:
data=np.random.randint(10,30,10)
data

array([25, 14, 23, 11, 13, 28, 24, 22, 19, 26])

In [85]:
type(data)

numpy.ndarray

In [87]:
# Creating Series
series=pd.Series(data)
series

0    25
1    14
2    23
3    11
4    13
5    28
6    24
7    22
8    19
9    26
dtype: int32

In [89]:
type(series)

pandas.core.series.Series

### Operations in Pandas Series

In [91]:
# To Search a value from Index 
series[4]

13

In [93]:
series>20

0     True
1    False
2     True
3    False
4    False
5     True
6     True
7     True
8    False
9     True
dtype: bool

In [95]:
# Search a value greater than 20
series[series>20]

0    25
2    23
5    28
6    24
7    22
9    26
dtype: int32

### Introduction to Pandas DataFrame

Creating Dataframe from Dictionary of Pandas Series

In [99]:
import numpy as np
data={'a':pd.Series(np.random.randint(10,20,5)),
      'b':pd.Series(np.random.randint(5,8,5)),
      'c':pd.Series(5,index=[0,1,2])}
data

{'a': 0    15
 1    13
 2    18
 3    13
 4    12
 dtype: int32,
 'b': 0    6
 1    5
 2    7
 3    7
 4    5
 dtype: int32,
 'c': 0    5
 1    5
 2    5
 dtype: int64}

In [101]:
type(data)

dict

In [103]:
# Converting Dictionary of Pandas Series to DataFarme
import pandas as pd
df=pd.DataFrame(data)
df

    a  b    c
0  15  6  5.0
1  13  5  5.0
2  18  7  5.0
3  13  7  NaN
4  12  5  NaN

In [105]:
df.loc[2:3,'b']

2    7
3    7
Name: b, dtype: int32

In [117]:
df.loc[0:4,'a':'c']

    a  b    c
0  15  6  5.0
1  13  5  5.0
2  18  7  5.0
3  13  7  NaN
4  12  5  NaN

In [141]:
data2 = [{'p': 2, 'q': 4}, {'p': 5, 'q': 10, 'r': 15}]

In [143]:
type(data2)

list

In [145]:
pd.DataFrame(data2)

   p   q     r
0  2   4   NaN
1  5  10  15.0

In [147]:
pd.DataFrame(data2, index=['IIT', 'Academy'])

         p   q     r
IIT      2   4   NaN
Academy  5  10  15.0

In [157]:
pd.DataFrame(data2, columns=['p', 'q'])

### Basic Functionality / Operations on DataFrame

In [161]:
# Extracting a column from data frame
n=df['a'] #for single column only
n

0    15
1    13
2    18
3    13
4    12
Name: a, dtype: int32

In [163]:
n=df[['a','b']] #for more than one column 
n

    a  b
0  15  6
1  13  5
2  18  7
3  13  7
4  12  5

In [165]:
n1=df[['a','b']]
n1

    a  b
0  15  6
1  13  5
2  18  7
3  13  7
4  12  5

In [167]:
type(n1)

pandas.core.frame.DataFrame

In [169]:
type(n)

pandas.core.frame.DataFrame

In [171]:
# Extracting 2 ormore columns from dataframe
p=df[['a','b','c']] #for multiple column - Imp
p

    a  b    c
0  15  6  5.0
1  13  5  5.0
2  18  7  5.0
3  13  7  NaN
4  12  5  NaN

In [173]:
type(p)

pandas.core.frame.DataFrame

In [175]:
df=pd.DataFrame(data)
df

    a  b    c
0  15  6  5.0
1  13  5  5.0
2  18  7  5.0
3  13  7  NaN
4  12  5  NaN

In [181]:
df.loc[2:,]

    a  b    c
2  18  7  5.0
3  13  7  NaN
4  12  5  NaN

In [183]:
# Extract an element from dataframe using Row Index
df.loc[2]

a    18.0
b     7.0
c     5.0
Name: 2, dtype: float64

In [185]:
# Extract an element from dataframe using Row Index and Column Index
df.loc[2,'b']

7

In [187]:
#Slicing multiple elements from dataframe using Row Index & Column Index. Here End Index is Included 
df.loc[2:3,'b':'c']

   b    c
2  7  5.0
3  7  NaN

In [189]:
# Slice multiple elements from dataframe
df.loc[2:,]

    a  b    c
2  18  7  5.0
3  13  7  NaN
4  12  5  NaN

In [191]:
df = pd.DataFrame(
[[4, 7, 10],
[5, 8, 11],
[6, 9, 12]],
index=[13, 14, 15])
df

    0  1   2
13  4  7  10
14  5  8  11
15  6  9  12

In [193]:
import pandas as pd
df = pd.DataFrame(
[[4, 7, 10],
[5, 8, 11],
[6, 9, 12]],
index=[13, 14, 15])
df

    0  1   2
13  4  7  10
14  5  8  11
15  6  9  12

In [197]:
df.loc[0:1,'1':'2']

Empty DataFrame
Columns: [1, 2]
Index: []

In [199]:
type(df)

pandas.core.frame.DataFrame

In [201]:
import pandas as pd
df1 = pd.DataFrame(
{"a" : [1 ,2, 3,7],
"b" : [4, 5, 6,8],
"c" : [7, 8, 9,9],
"d" : [1, 7, 9,0],
"e" : [8, 9, 9,1]
},
index = [10, 2, 3,4])
df1

    a  b  c  d  e
10  1  4  7  1  8
2   2  5  8  7  9
3   3  6  9  9  9
4   7  8  9  0  1

In [203]:
#Renaming a column in dataframe
df2=df1.rename(columns = {'c':'c1'})
df2

    a  b  c1  d  e
10  1  4   7  1  8
2   2  5   8  7  9
3   3  6   9  9  9
4   7  8   9  0  1

In [209]:
df1

    a  b  c  d  e
10  1  4  7  1  8
2   2  5  8  7  9
3   3  6  9  9  9
4   7  8  9  0  1

In [211]:
df1.rename(columns = {'c':'c1'}, inplace=True)

In [213]:
df1

    a  b  c1  d  e
10  1  4   7  1  8
2   2  5   8  7  9
3   3  6   9  9  9
4   7  8   9  0  1

### Order rows by values of a column (high to low).
df1.sort_values('c1',ascending=False)

In [220]:
# Select columns in positions 1, 2 and 5 (first column is 0).
df1.iloc[:,2:3]

    c1
10   7
2    8
3    9
4    9

In [222]:
df1.iloc[0:3,0:3]

    a  b  c1
10  1  4   7
2   2  5   8
3   3  6   9

In [224]:
# Select columns in positions 1, 2 and 5 (first column is 0).
df1.iloc[:,[1,2,3]]

    b  c1  d
10  4   7  1
2   5   8  7
3   6   9  9
4   8   9  0

In [226]:
# Select rows meeting logical condition, and only the specific columns.
df1.loc[df1['a'] > 5, ['a','c1']]

   a  c1
4  7   9

### Statistical Operations on Pandas Dataframe

In [228]:
df1

    a  b  c1  d  e
10  1  4   7  1  8
2   2  5   8  7  9
3   3  6   9  9  9
4   7  8   9  0  1

In [230]:
# Find Mean Column wise - Default Columnwise (axis=0)
df1.mean()

a     3.25
b     5.75
c1    8.25
d     4.25
e     6.75
dtype: float64

In [232]:
# Find Mean Rowwise
df1.mean(axis=1)

10    4.2
2     6.2
3     7.2
4     5.0
dtype: float64

In [234]:
# Find sum Columnwise
df1.sum()

a     13
b     23
c1    33
d     17
e     27
dtype: int64

In [236]:
# Find Sum rowise
df1.sum(axis=1) #rowwise sum

10    21
2     31
3     36
4     25
dtype: int64

### Find Missing Values in DataFrame

In [240]:
df.isnull().sum()

0    0
1    0
2    0
dtype: int64

In [242]:
df

    0  1   2
13  4  7  10
14  5  8  11
15  6  9  12

In [244]:
# Drop columns with Missing Values
df.dropna(axis=1)

    0  1   2
13  4  7  10
14  5  8  11
15  6  9  12

In [246]:
# Drop rows with Missing Values
df.dropna(axis=0)

    0  1   2
13  4  7  10
14  5  8  11
15  6  9  12

In [248]:
# Fill NA values with 0 --> Fill happens on original df
df.fillna(0) # imputation

    0  1   2
13  4  7  10
14  5  8  11
15  6  9  12

In [250]:
# Filling NA by Forward Fill --> Fill happens on original df
df.fillna(method='ffill')

C:\Users\Arung\AppData\Local\Temp\ipykernel_3008\944938504.py:2: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill')

    0  1   2
13  4  7  10
14  5  8  11
15  6  9  12

In [252]:
# Fill na with backward --> Fill happens on original df
df.fillna(method='bfill')

C:\Users\Arung\AppData\Local\Temp\ipykernel_3008\489641704.py:2: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='bfill')

    0  1   2
13  4  7  10
14  5  8  11
15  6  9  12

In [256]:
# Fill na with mean
df.fillna(df.mean())

    0  1   2
13  4  7  10
14  5  8  11
15  6  9  12

### Importing & Exporting Data

Reading Excel File

In [258]:
pwd

'C:\\Users\\Arung\\Downloads\\DATA_SCIENCE\\DATA_ANALYTICS\\02_Numpy and Pandas\\02_Pandas'

In [268]:
# pd.read_csv(r"C:\Users\Arung\OneDrive\Desktop\Quikr Analysis.ipynb")

# if you want to import the file directly in the jupyter environment from the recent folder (then apply this)

ParserError: Error tokenizing data. C error: Expected 1 fields in line 4, saw 2

In [260]:
data=pd.read_excel('iris.xlsx')
data

     Sepal.Length  Sepal.Width  Petal.Length  Petal.Width    Species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [272]:
data.head(10)

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa
5           5.4          3.9           1.7          0.4  setosa
6           4.6          3.4           1.4          0.3  setosa
7           5.0          3.4           1.5          0.2  setosa
8           4.4          2.9           1.4          0.2  setosa
9           4.9          3.1           1.5          0.1  setosa

In [274]:
data.tail(10)

     Sepal.Length  Sepal.Width  Petal.Length  Petal.Width    Species
140           6.7          3.1           5.6          2.4  virginica
141           6.9          3.1           5.1          2.3  virginica
142           5.8          2.7           5.1          1.9  virginica
143           6.8          3.2           5.9          2.3  virginica
144           6.7          3.3           5.7          2.5  virginica
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

Exporting the DataFrame as a Excel file

In [ ]:
data.to_excel('irisnew.xlsx')